Linked Imported Files cannot be copied across projects. All non-RVT linked files will be pasted as imports instead.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCopyImportInstancesAcrossProjects { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCopyImportInstancesAcrossProjects As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCopyImportInstancesAcrossProjects {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace